emacs.d/configuration.org
#+TITLE: Emacs Configuration
#+AUTHOR: Deyan Dyankov
#+OPTIONS: toc:nil num:nil

* Use sensible-defaults.el
Use [[https://github.com/hrs/sensible-defaults.el][sensible-defaults.el]] for some basic settings.

#+BEGIN_SRC emacs-lisp
  (load-file "~/.emacs.d/sensible-defaults.el")
  (sensible-defaults/use-all-settings)
  (sensible-defaults/use-all-keybindings)
  (sensible-defaults/backup-to-temp-directory)
#+END_SRC

* themes
#+BEGIN_SRC emacs-lisp
(require 'doom-themes)

;; Global settings (defaults)
(setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
      doom-themes-enable-italic t) ; if nil, italics is universally disabled

;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
;; may have their own settings.
(load-theme 'doom-dracula t)

;; Enable flashing mode-line on errors
(doom-themes-visual-bell-config)

;; Enable custom neotree theme (all-the-icons must be installed!)
;; (doom-themes-neotree-config)
;; or for treemacs users
;; (doom-themes-treemacs-config)

;; Corrects (and improves) org-mode's native fontification.
(doom-themes-org-config)
#+END_SRC

* org config
org configuration
#+BEGIN_SRC emacs-lisp
(require 'org)
(require 'ox-twbs)
(setq org-agenda-files (list "~/org/personal.org"
                             "~/org/recurring.org"))
(setq org-log-done t)
(setq org-export-coding-system 'utf-8)
(setq org-ellipsis "⤵")
(define-key global-map "\C-ca" 'org-agenda)
#+END_SRC

do not show TODOs scheduled for further than the current agenda view
#+BEGIN_SRC emacs-lisp
(setq org-agenda-todo-ignore-scheduled 'future)
(setq org-agenda-tags-todo-honor-ignore-options t)
#+END_SRC

org bullets
#+BEGIN_SRC emacs-lisp
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC

disable deadline reminders
#+BEGIN_SRC emacs-lisp
(setq org-deadline-warning-days 0)
#+END_SRC

* calendar settings
#+BEGIN_SRC emacs-lisp
(add-hook 'calendar-load-hook (lambda () (calendar-set-date-style 'european)))
(setq calendar-week-start-day 1)
#+END_SRC
* magit
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x g") 'magit-status)
(global-set-key (kbd "C-x M-g") 'magit-dispatch-popup)
#+END_SRC
* mu4e
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "/Users/deyandyankov/repos/mu/mu4e")
(require 'mu4e)
(setq
  mu4e-mu-binary     "/usr/local/bin/mu"
  mu4e-maildir       "~/Mail"   ;; top-level Maildir
  mu4e-sent-folder   "/sent"       ;; folder for sent messages
  mu4e-drafts-folder "/drafts"     ;; unfinished messages
  mu4e-trash-folder  "/trash"      ;; trashed messages
  mu4e-refile-folder "/archive")   ;; saved messages
(setq
  mu4e-get-mail-command "offlineimap"   ;; or fetchmail, or ...
  mu4e-update-interval 300)             ;; update every 5 minutes
#+END_SRC
* julia
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/repos/julia-emacs")
(require 'julia-mode)
#+END_SRC
